## Group Project 2
### Data Visualization

In [110]:
#Code Block 1
## import libraries

import os
import sys

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

plt.style.use("seaborn-v0_8")
sns.set_style("whitegrid")

%matplotlib inline

In [111]:
#Code Block 2
## load the data

df_train = pd.read_csv("../../data/train.csv")
df_test = pd.read_csv("../../data/test.csv")
df_gender = pd.read_csv("../../data/gender_submission.csv")

In [112]:
#Code Block 3
## view the training data

display(df_train.info())
df_train.head()

# PassengerID -> unique identifier for each passenger
# Survived -> target variable (0 = did not survive, 1 = survived)
# Pclass -> passenger class (1 = 1st class, 2 = 2nd class, 3 = 3rd class)
# Name -> name
# Sex -> gender
# Age -> age in years
# SibSp -> number of siblings/spouses aboard the Titanic
# Parch -> number of parents/children aboard the Titanic
# Ticket -> ticket number
# Fare -> passenger fare
# Cabin -> cabin number
# Embarked -> port of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [113]:
#Code Block 4
## view the test data

display(df_test.info())
df_test.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

None

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [114]:
#Code Block 5
## view the test submission - just an example we do not need to use this data

display(df_gender.info())
df_gender.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

None

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [115]:
#Code Block 6
## feature engineering idea - create a new feature called "title" which extracts the title from the name column
## feature engineering idea - create a new feature called "family_size" which is the sum of SibSp and Parch + 1 (for the passenger themselves)
## handle missing values

display(df_train.isnull().sum())
display(df_test.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [116]:
#Code Block 6
## check the percentage of missing values in each column

display(df_train.isnull().sum()/len(df_train))
display(df_test.isnull().sum()/len(df_test))

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

PassengerId    0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.205742
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.002392
Cabin          0.782297
Embarked       0.000000
dtype: float64

In [117]:
#Code Block 7
## fill missing values in the fare column with 0 -- snuck onto ship
## fill missing values in the fare column with the median fare for passengers in 3rd class -- most likely the passenger was in 3rd class and did not pay for their ticket
display(df_test[df_test["Fare"].isnull()])
median_fare = df_test[df_test["Pclass"]==3]["Fare"].median()
display(median_fare)
df_test["Fare"].fillna(median_fare, inplace=True)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S

7.8958

/var/folders/mm/xkwn8c6n2djgfy47v6p2myf00000gn/T/ipykernel_83469/2832499789.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_test["Fare"].fillna(median_fare, inplace=True)

In [118]:
#Code Block 8
## create the "title" feature by extracting the title from the name column
## Mr., Mrs., Miss., Master., etc.
display(df_train["Name"].head())
df_train["Title"] = df_train["Name"].str.extract(" ([A-Za-z]+)\.", expand=False)
display(df_train["Title"].value_counts(dropna = False))

def clean_title(title):
    if title in ["Mr", "Mrs", "Miss", "Master", "Dr", "Rev"]:
        return title
    elif title == "Ms":
        return "Miss"
    elif title == "Sir":
        return "Mr"
    else: return "Other"

df_train["Title"] = df_train["Title"].apply(clean_title)
df_test["Title"] = df_test["Name"].str.extract(" ([A-Za-z]+)\.", expand=False)
df_test["Title"] = df_test["Title"].apply(clean_title)
display(df_train["Title"].value_counts(dropna = False))
display(df_test["Title"].value_counts(dropna = False))

<>:5: SyntaxWarning: invalid escape sequence '\.'
<>:18: SyntaxWarning: invalid escape sequence '\.'
<>:5: SyntaxWarning: invalid escape sequence '\.'
<>:18: SyntaxWarning: invalid escape sequence '\.'
/var/folders/mm/xkwn8c6n2djgfy47v6p2myf00000gn/T/ipykernel_83469/4054218699.py:5: SyntaxWarning: invalid escape sequence '\.'
  df_train["Title"] = df_train["Name"].str.extract(" ([A-Za-z]+)\.", expand=False)
/var/folders/mm/xkwn8c6n2djgfy47v6p2myf00000gn/T/ipykernel_83469/4054218699.py:18: SyntaxWarning: invalid escape sequence '\.'
  df_test["Title"] = df_test["Name"].str.extract(" ([A-Za-z]+)\.", expand=False)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

Title
Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Countess      1
Capt          1
Ms            1
Sir           1
Lady          1
Mme           1
Don           1
Jonkheer      1
Name: count, dtype: int64

Title
Mr        518
Miss      183
Mrs       125
Master     40
Other      12
Dr          7
Rev         6
Name: count, dtype: int64

Title
Mr        240
Miss       79
Mrs        72
Master     21
Other       3
Rev         2
Dr          1
Name: count, dtype: int64

In [119]:
#Code Block 9
## fill the missing values for age with the median age for each SibSp and Parch

median_age = df_train.groupby(["SibSp", "Parch"])["Age"].median()
overall_median_age = df_train["Age"].median()
print(overall_median_age)

def fill_age(row):
    if pd.isnull(row["Age"]):
        key = (row["SibSp"], row["Parch"])
        if key in median_age:
            if pd.isnull(median_age[key]):
                return overall_median_age
            else:
                return median_age[key]
        else:
            return overall_median_age
    else:
        return row["Age"]
    
df_train["Age"] = df_train.apply(fill_age, axis=1)
df_test["Age"] = df_test.apply(fill_age, axis = 1)

display(df_train.isnull().sum())
display(df_test.isnull().sum())

28.0

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Title            0
dtype: int64

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
Title            0
dtype: int64

In [120]:
#Code Block 10
## drop cabin values

df_train.drop("Cabin", axis=1, inplace=True)
df_test.drop("Cabin", axis=1, inplace=True)

In [121]:
#Code Block 11
## embarked values
display(df_train[df_train["Embarked"].isnull()])

## fill the missing values with the port that most passengers embarked from
most_common_port = df_train["Embarked"].mode()[0]
print(most_common_port)
df_train["Embarked"] = df_train["Embarked"].fillna(most_common_port)

df_train.isnull().sum()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN,Miss
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN,Mrs

S

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Title          0
dtype: int64

In [122]:
#Code Block 12
## create the "family_size" feature by summing SibSp and Parch + 1 (for the passenger themselves)
df_train["family_size"] = df_train["SibSp"] + df_train["Parch"] + 1
df_test["family_size"] = df_test["SibSp"] + df_test["Parch"] + 1

display(df_train.head(), df_test.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title,family_size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,Mr,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,Mrs,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,Miss,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,Mrs,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,Mr,1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title,family_size
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q,Mr,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,Mrs,2
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q,Mr,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S,Mr,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,Mrs,3

In [123]:
#Code Block 13
## drop unecessary columns
## name
## ticket

df_train = df_train.drop(["Name", "Ticket"], axis=1)
df_test = df_test.drop(["Name", "Ticket"], axis=1)

display(df_train.info(), df_test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Embarked     891 non-null    object
 9   Title        891 non-null    object
 10  family_size  891 non-null    int64
dtypes: float64(2), int64(6), object(3)
memory usage: 76.7+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          418 non-null    float64
 4   SibSp        418 non-null    int64
 5   Parch        418 non-null    int64
 6   Fare         418 non-null    float64
 7   Embarked     418 non-null    object
 8   Title        418 non-null    object
 9   family_size  418 non-null    int64
dtypes: float64(2), int64(5), object(3)
memory usage: 32.8+ KB

None

None

In [125]:
#Code Block 14
## save the cleaned data
if not os.path.exists("../../data/cleaned"):
    os.makedirs("../../data/cleaned")
else:
    print("Directory already exists. Saving cleaned data to ../../data/cleaned/cleaned_train.csv and ../../data/cleaned/cleaned_test.csv")

df_train.to_csv("../../data/cleaned/cleaned_train.csv", index=False)
df_test.to_csv("../../data/cleaned/cleaned_test.csv", index=False)
print("Data preprocessing complete. Cleaned data saved to ../../data/cleaned/cleaned_train.csv and ../../data/cleaned/cleaned_test.csv")

Data preprocessing complete. Cleaned data saved to ../../data/cleaned/cleaned_train.csv and ../../data/cleaned/cleaned_test.csv